app/Controllers/Home.php

    public function tabel()
    {
        $data['dataobjek'] = $this->tabeltitikwisata->findAll();
---
SELECT *
FROM "wisata-geo"

    public function edit_data($gid)
    {
        $data['dataobjek'] = $this->tabeltitikwisata->find($gid);
---
SELECT *
FROM "wisata-geo"
WHERE "wisata-geo"."gid" = '2'

            'foto' => $nama_foto,
        ];

        if (!$this->tabeltitikwisata->save($data)) {
---
UPDATE "wisata-geo" SET "deskripsi" = 'Pantai Glagah sendiri merupakan salah satu destinasi wisata favorit di Kulon Progo atau bahkan bisa dibilang sebagai icon kota ini, meskipun beberapa tahun terakhir ini banyak destinasi wisata baru di Kulon Progo seperti Kedung Pedut, Kalibiru, dan masih banyak lagi, tetapi pesona Pantai Glagah tetap menjadi Primadona di kota ini', "alamat" = 'Macanan, Glagah, Kec. Temon, Kabupaten Kulon Progo, Daerah Istimewa Yogyakarta 55654', "latitude" = '-7.912075', "longitude" = '110.064825', "htm" = 'Rp 6.000', "jenis" = 'Pantai', "foto" = 'pp.png'
WHERE "wisata-geo"."gid" IN ('2')

    public function tabeldb()
    {
        $data['dataobjek'] = $this->tabeltitikwisata->findAll();
---
SELECT *
FROM "wisata-geo"